<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Homebrew.</string>
    <key>Identifier</key>
    <string>com.github.munki-tvlk.download.Homebrew</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Homebrew</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3.0</string>
    <key>Process</key>
    <array>
        <!-- Ambil info release GitHub -->
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>Homebrew/brew</string>
                <key>asset_regex</key>
                <string>Homebrew-[0-9]+\.[0-9]+\.[0-9]+\.pkg</string>
            </dict>
        </dict>

        <!-- Download file .pkg -->
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.pkg</string>
            </dict>
        </dict>

        <!-- Verifikasi signature -->
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Patrick Linnane (927JGANW46)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
