<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Reactotron.</string>
    <key>Identifier</key>
    <string>com.github.munki-tvlk.download.Reactotron</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Reactotron (Apple)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>Reactotron-[0-9]+.[0-9]+.[0-9]+[-_]+arm64.dmg</string>
                <key>github_repo</key>
                <string>infinitered/reactotron</string>
            </dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Reactotron.app</string>
                <key>requirement</key>
                <string>identifier "com.reactotron.app" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = L7YNDPLSEB</string>
			</dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
				<key>input_plist_path</key>
				<string>%pathname%/Reactotron.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
    </array>
</dict>
</plist>
